package com.mcore.hsbc.ecif.infrastructure.constants;

/**
* *********************************************************************************************************************
* <br>    系统名称：外网通用分布式核心
* <br>    微服务名称：HSBC ECIF DEMO
* <br>    版本号：head
* <br>    创建者：zj_zengq
* <br>    创建日期：2025-09-19 14:45:51
* <br>    程序功能：
* <br> ----------------------------------------------------------------------------------------------------------------
* <br>    功能及场景描述：
* <br> ----------------------------------------------------------------------------------------------------------------
* <br>    修改说明：
* <br>    日期   修改人    修改说明
* <br> ----------------------------------------------------------------------------------------------------------------
* <br>
*
*/

public class SymbolConstant {

    /**
    * 竖线
    **/
    public static final String VERTICAL_SYMBOL = "\\|";

    /**
    * 点
    **/
    public static final String DOT_SYMBOL = "\\.";

    /**
    * 空
    **/
    public static final String EMPTY_SYMBOL = "";

    /**
    * 横杠
    **/
    public static final String ROD_SYMBOL = "-";
}
